{
 "title": "Codename: Event Horizon - qwoynd v5.1.0 upgrade.",
 "authors": "qwoyn1mqtnspwqmuqpwera2p24j0gy0v5ajz9kh0f0q7",
 "summary": "The Qwoyn Network chain is undergoing a significant upgrade with version 5.1.0. The upgrade addresses an oversight from the genesis phase, introduces a Command Line Interface (CLI) endpoint for future upgrades, and enables funding for the internal Liquidity Pool (LP) between QWOYN and COHO tokens. This enhancement enhances functionality, interoperability, and transaction efficiency within the network.",
 "details": "## Overview\n\nThe following upgrade brings crucial enhancements to the Qwoyn Network chain, addressing an oversight that occurred during the genesis phase. Additionally, it introduces a new feature in the form of a Command Line Interface (CLI) endpoint, aimed at optimizing the efficiency of future upgrades. Moreover, this upgrade enables the provision of funding for the internal Liquidity Pool (LP) between QWOYN and COHO tokens, further enhancing the ecosystem's functionality and interoperability.\n\n## Upgrade Details\n\n### COHO Minting\n\nIn order to rectify the aforementioned oversight, this upgrade includes the minting of 500,000,000 COHO tokens to the game manager module. This action ensures that the necessary token supply is available to facilitate seamless operations within the Qwoyn Network chain.\n\n### CLI Endpoint Addition\n\nTo streamline and enhance the upgrade process, a new Command Line Interface (CLI) endpoint has been introduced. This addition significantly improves the efficiency and effectiveness of future upgrades, allowing for smoother integration and deployment of enhancements to the Qwoyn Network chain.\n\n### Internal Liquidity Pool (LP) Funding\n\nUpon successful completion of this upgrade, the infrastructure will be in place to support the internal Liquidity Pool (LP) between QWOYN and COHO tokens. This funding mechanism enhances the overall functionality and usability of the network, promoting liquidity provision and enabling seamless transactions between QWOYN and COHO tokens.\n\nPlease note that this upgrade represents a significant step forward in the evolution of the Qwoyn Network chain, enabling a more robust and efficient ecosystem. It is essential to follow the provided upgrade instructions carefully to ensure a successful implementation.\n\nFor detailed instructions and additional information, please refer to the [commonwealth post](https://commonwealth.im/qwoyn-network/discussion/11774-coho-token-initial-mint-and-internal-lp-integration-qwoyndv510).\n\n*Release version: 5.1.0*\n\n*Upgrade date: 7/5/2023, ~1800UTC*",
 "proposal_forum_url": "https://commonwealth.im/qwoyn-network/discussion/11774-coho-token-initial-mint-and-internal-lp-integration-qwoyndv510",
 "vote_option_context": "A YES vote prepares the chain for the v5.1.0 upgrade."
}
